[{"text": "Instruction: Please state the balance of Common Stock in the annual report.\n\nQuestion: What is the Common Stock of company X in 2024?\n\nAnswer: According to the balance sheet, the Common Stock amounts to $5,000,000 USD."},
{"text": "Instruction: Generate a Python code snippet to calculate the Net Present Value (NPV) of an investment.\n\nQuestion: How to calculate the NPV in Python for cash flows [1000, 2000, 3000] and a discount rate of 5%?\n\nAnswer: ```python\nimport numpy_financial as npf\nflows = [-1000, 1000, 2000, 3000]\ndiscount_rate = 0.05\nnpv = npf.npv(discount_rate, flows)\nprint(npv)\n```"},
{"text": "Instruction: Reason through the solution to the posed question step-by-step.\n\nQuestion: If a company has assets of $50M and liabilities of $20M, what is its shareholder equity?\n\nAnswer: Reasoning: 1. Shareholder equity is calculated as Assets minus Liabilities. 2. Assets: $50M. 3. Liabilities: $20M. 4. Calculation: $50M - $20M = $30M. Therefore, the shareholder equity is $30M."},
{"text": "Instruction: Define the financial concept of a 'Put Option' and its main use.\n\nQuestion: What is a Put Option?\n\nAnswer: A Put Option is a contract that gives the holder the right, but not the obligation, to sell an underlying asset at a predetermined price (strike price) on or before an expiration date. It is primarily used to hedge short positions or to speculate on a price decline."},
{"text": "Instruction: Explain the difference between common stock and preferred stock.\n\nQuestion: Key differences between Common and Preferred Stock.\n\nAnswer: Common stock grants voting rights and a variable dividend. Preferred stock, on the other hand, usually does not have voting rights but gives priority in dividend payments (usually fixed) and asset liquidation."},
{"text": "Instruction: Perform a credit risk assessment for a client.\n\nQuestion: Assess the default risk of a client with a debt-to-equity ratio of 2.5 and a negative operating cash flow.\n\nAnswer: Assessment: A ratio of 2.5 indicates high reliance on debt, and a negative operating cash flow suggests the business does not generate enough cash to cover its basic operations. The default risk is considered High, requiring further collateral analysis."},
{"text": "Instruction: What does 'Double Taxation' imply in an international investment context?\n\nQuestion: Definition of Double Taxation in finance.\n\nAnswer: Double Taxation refers to the phenomenon of taxing the same income twice, usually once in the country where the income is generated (source) and again in the investor's country of residence. Double taxation treaties seek to mitigate this effect."},
{"text": "Instruction: Write a short Python function that checks if a stock is overvalued using the P/E Ratio.\n\nQuestion: Code to check P/E > 20.\n\nAnswer: ```python\ndef is_overvalued(pe_ratio):\n    if pe_ratio > 20:\n        return True\n    else:\n        return False\n```"},
{"text": "Instruction: Describe the relationship of monetary policy on bond valuation.\n\nQuestion: How does an interest rate hike affect bonds?\n\nAnswer: When the central bank raises interest rates, new bonds are issued with higher yields. This causes existing bonds with lower nominal yields to lose value in the secondary market to match the prevailing rates, so their price drops."},
{"text": "Instruction: Provide the basic formula for calculating Return on Equity (ROE).\n\nQuestion: What is the formula for ROE?\n\nAnswer: Return on Equity (ROE) is calculated as: Net Income / Shareholder Equity."}]